app/controllers/users_controller.rb

  def show
    @user = User.find_by id: params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hai van 123"], ["password_digest", "$2a$10$4bN.FzuA3zJXFsq4BNrz7.DbO9VwYTLv4V80rTSCCraoHKFIVBeiW"], ["updated_at", "2021-01-29 02:56:29.303432"], ["id", 11]]

  def destroy
    User.find_by(id: params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]